In [26]:
import pandas as pd
import numpy as np
import json
import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

# Logging in to database

In [27]:
with open("c:/Users/oscar/.secret/sql_key.json", "r") as f:
    login = json.load(f)
login.keys()

dict_keys(['sql_key'])

In [28]:
connection = f"mysql+pymysql://root:{login['sql_key']}@localhost/movie_db"

In [29]:
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/movie_db)

In [30]:
database_exists(connection)

True

# Loading Data

In [2]:
# storing data for each year in list
data_list = []
for i in range(2000, 2023):
    data = pd.read_json(f"Data/tmdb_api_results{i}.json")
    data_list.append(data)

In [3]:
# concatenating our dataframes
final_df = pd.concat(data_list, axis=0)

In [4]:
# checking the len of our final_df
len(final_df)

60948

In [5]:
final_df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,None,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.4,21.0,
2,tt0113092,0.0,None,None,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,4.4,7.0,
3,tt0116391,0.0,None,None,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,,Gang,0.0,0.0,0.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,None,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,1865.0,PG

# Dropping unwanted columns

In [6]:
cols_to_drop = []
for col in final_df.columns:
    if (col != "imdb_id") and (col != "revenue") and (col != "budget") and (col != "certification"):
        cols_to_drop.append(col)

In [7]:
cols_to_drop

['adult',
 'backdrop_path',
 'belongs_to_collection',
 'genres',
 'homepage',
 'id',
 'original_language',
 'original_title',
 'overview',
 'popularity',
 'poster_path',
 'production_companies',
 'production_countries',
 'release_date',
 'runtime',
 'spoken_languages',
 'status',
 'tagline',
 'title',
 'video',
 'vote_average',
 'vote_count']

In [8]:
final_df = final_df.drop(columns=cols_to_drop)
final_df.head()

     imdb_id      budget     revenue certification
0          0         NaN         NaN           NaN
1  tt0113026  10000000.0         0.0
2  tt0113092         0.0         0.0
3  tt0116391         0.0         0.0           NaN
4  tt0118694    150000.0  12854953.0            PG

# Preprocessing Data

In [9]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 60948 entries, 0 to 858
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        60948 non-null  object
 1   budget         60925 non-null  float64
 2   revenue        60925 non-null  float64
 3   certification  36432 non-null  object
dtypes: float64(2), object(2)
memory usage: 2.3+ MB

In [10]:
# only interested in movies with certifications
final_df["certification"].value_counts()

                                   21638
R                                   6166
NR                                  3297
PG-13                               3263
PG                                  1454
G                                    446
NC-17                                156
Unrated                                5
-                                      1
UR                                     1
Not Rated                              1
ScreamFest Horror Film Festival        1
R                                      1
PG-13                                  1
10                                     1
Name: certification, dtype: int64

In [11]:
# replacing "" with NA
final_df = final_df.replace({"": np.nan})

In [12]:
final_df["certification"].value_counts(dropna=False)

NaN                                46154
R                                   6166
NR                                  3297
PG-13                               3263
PG                                  1454
G                                    446
NC-17                                156
Unrated                                5
-                                      1
UR                                     1
Not Rated                              1
ScreamFest Horror Film Festival        1
R                                      1
PG-13                                  1
10                                     1
Name: certification, dtype: int64

In [13]:
# dropping null values
final_df = final_df.dropna(subset=["certification"])

In [14]:
# removing whitespace from column
final_df["certification"] = final_df["certification"].str.rstrip()

In [15]:
final_df["certification"].value_counts(dropna=False)

R                                  6167
NR                                 3297
PG-13                              3264
PG                                 1454
G                                   446
NC-17                               156
Unrated                               5
-                                     1
UR                                    1
Not Rated                             1
ScreamFest Horror Film Festival       1
10                                    1
Name: certification, dtype: int64

In [16]:
# filtering out certifications of interest
r_filter = final_df["certification"] == "R"
pg_13_filter = final_df["certification"] == "PG-13"
pg_filter = final_df["certification"] == "PG"
g_filter = final_df["certification"] == "G"

final_df = final_df.loc[r_filter | pg_13_filter | pg_filter | g_filter, :]

In [17]:
final_df["certification"].value_counts()

R        6167
PG-13    3264
PG       1454
G         446
Name: certification, dtype: int64

In [18]:
final_df.head()

      imdb_id      budget     revenue certification
4   tt0118694    150000.0  12854953.0            PG
5   tt0118852         0.0         0.0             R
6   tt0119273  15000000.0         0.0             R
7   tt0119495         0.0         0.0             R
11  tt0120467    120000.0     14904.0             R

# Saving Data

In [39]:
from sqlalchemy.types import *

In [19]:
final_df.to_csv("Data/tmdb_results_combined_2000-2022")

In [21]:
# checking if our file saved correctly
final_df = pd.read_csv("Data/tmdb_results_combined_2000-2022", index_col=0)
final_df.head()

      imdb_id      budget     revenue certification
4   tt0118694    150000.0  12854953.0            PG
5   tt0118852         0.0         0.0             R
6   tt0119273  15000000.0         0.0             R
7   tt0119495         0.0         0.0             R
11  tt0120467    120000.0     14904.0             R

In [47]:
# user defined function to create schema
def to_sql_table(df, columns, dtypes):
    key_inc = 0
    schema = {}
    for x, col in enumerate(columns):
        if (key_inc == 0) and (dtypes[x] == "object"):
            key_len = df[col].fillna("").map(len).max()
            schema[col] = String(key_len+1)
            
            key_inc += 1
            
        elif (dtypes[x] == "object"):
            col_len = df[col].fillna("").map(len).max()
            schema[col] = Text(col_len)
            
        elif str(dtypes[x]).find("f") != -1:
            schema[col] = Float()
        
        elif str(dtypes[x]).find("i") != -1:
            schema[col] = Integer()
        
        elif dtypes[x] == "bool" != -1:
            schema[col] = Boolean()

    return schema

In [36]:
tmdb_cols = list(final_df.columns)
tmdb_dtypes = list(final_df.dtypes)

display(tmdb_cols)
tmdb_dtypes

['imdb_id', 'budget', 'revenue', 'certification']

[dtype('O'), dtype('float64'), dtype('float64'), dtype('O')]

In [40]:
tmdb_schema = to_sql_table(df=final_df, columns=tmdb_cols, dtypes=tmdb_dtypes)
tmdb_schema

{'imdb_id': String(length=11),
 'budget': Float(),
 'revenue': Float(),
 'certification': Text(length=5)}

In [41]:
final_df.to_sql("tmdb_data", engine, dtype=tmdb_schema, if_exists="replace", index=False)

In [42]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [45]:
# checking if our table got saved to our data base
q = """SELECT COUNT(*) AS table_count
       FROM tmdb_data;"""
pd.read_sql(q, engine)

   table_count
0        11331